import requests
import os
BLACK = '\033[30m'
RED = '\033[31m'
GREEN = '\033[32m'
YELLOW = '\033[33m'
BLUE = '\033[34m'
MAGENTA = '\033[35m'
CYAN = '\033[36m'
WHITE = '\033[37m'
RESET = '\033[38m'
os.system("clear")

print(RED+"████████████████████████")
print("█▄─▄▄▀█▄─▄▄▀█─▄▄─█─▄▄▄▄█")
print("██─██─██─██─█─██─█▄▄▄▄─█")
print("▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▄▀▄▄▄▄▄▀")
print(" ")
print(" ")
print(" ")
print(BLUE+"𝙏𝙞𝙠𝙏𝙤𝙠 : 𝙏𝙚𝙧𝙢𝙞𝙣𝙖𝙡𝙏𝙪𝙩𝙤𝙧𝙞𝙖𝙡𝙚𝙨.𝙚𝙭𝙚")
print(BLUE+"𝙂𝙞𝙩𝙃𝙪𝙗 : 𝙏𝙚𝙧𝙢𝙞𝙣𝙖𝙡𝙏𝙪𝙩𝙤𝙧𝙞𝙖𝙡𝙚𝙨")
print(BLUE+"𝘿𝘼𝙏𝙀 : 2489𝙃𝙯")
print(" ")
print(" ")
print(" ")
url = input(CYAN+"𝙐𝙍𝙇 : ")
port = input(CYAN+"𝙋𝙊𝙍𝙏 : ")
while True:
    r = requests.get(url)
    r.history
    r.status_code
    200
    r.url
    (url)
    try:
     print(GREEN+"[=] 𝙍𝙀𝙋𝙊𝙍𝙏 𝙍𝙀𝘼𝘿𝙔 𝘿𝘿𝙊𝙎 =  ", (url))
    except:
        print(RED+"[•] 𝙀𝙍𝙍𝙊𝙎 𝙀𝙎 𝙋𝙊𝙎𝙄𝘽𝙇𝙀 𝙌𝙐𝙀 𝙇𝘼 𝙄𝙋 𝙊 𝙋𝙐𝙀𝙍𝙏𝙊 𝙉𝙊 𝙀𝙎 𝘾𝙊𝙍𝙍𝙀𝘾𝙏𝙊")
